{
  "firstTimeGreeting": [
    {
      "content": "Hey! I'm super excited that you called! Want to know what I've got in store for us today?",
      "role": "Ben",
      "audio": null
    },
    {
      "userResponse": true
    },
    {
      "content": "Today we're visiting Sensei! He owns a Japanese restaurant and makes all sorts of delicious food, samurai style! You know what a samurai is, right buddy?",
      "role": "Ben",
      "audio": null
    },
    {
      "userResponse": true
    },
    {
      "content": "[footsteps]",
      "role": "Sound",
      "audio": null
    },
    {
      "content": "Cool! Well, I heard Sensei needs some samurai chef apprentices. Let's go find out more!",
      "role": "Ben",
      "audio": null
    },
    {
      "content": "Greetings, Sensei! This is my friend. We're here to learn your ways!",
      "role": "Ben",
      "audio": null
    },
    {
      "content": "Hello! Ah, you wish to be my disciples. First, I have one question: do you like... sushi?",
      "role": "Sensei",
      "audio": null
    },
    {
      "content": "I love it!",
      "role": "Ben",
      "audio": null
    },
    {
      "content": "People say I'm the wisest, most skilled sushi samurai in the world! But my passion is also to teach others. Do you have what it takes to learn from a master?",
      "role": "Sensei",
      "audio": null
    },
    {
      "userResponse": true
    },
    {
      "content": "Oh yeah! Let's prove to Sensei that we can become Sushi Masters!  Alexa, tell us the available paths!",
      "role": "Ben",
      "audio": null
    }
  ],
  "playerWithAwardsGreeting": [
    {
      "content": "Welcome back! I'm so happy to see you again....Alexa, please give our friend a royal greeting!",
      "role": "Ben",
      "audio": null
    },
    {
      "content": "%titles%. You have %low_color% belt Chef, %mid_color% belt Sumo, %high_color% belt Guru.",
      "role": "Alexa",
      "audio": null
    }
  ],
  "exitPhrase": [
    {
      "content": "I don't believe it! You have become the Ultimate Samurai Chef! It is an honor being your friend!",
      "role": "Sensei",
      "audio": null
    },
    {
      "content": "You're amazing! Now that's an incredible nickname that's well earned! How do you feel about becoming the Ultimate Sushi Samurai?",
      "role": "Ben",
      "audio": null
    },
    {
      "userResponse": true
    },
    {
      "content": "It's been a pleasure teaching you. Perhaps there will be greater challenges someday for you to master!",
      "role": "Sensei",
      "audio": null
    },
    {
      "content": "Thanks Sensei. Well, one thing you can do is reset your progress. Would you like to start Samurai Chef all over?",
      "role": "Ben",
      "audio": null
    }
  ]
}
